# Set the directory for installing applications and casks.
cask_args appdir: '/Applications'

# Install necessary `homebrew`, `macOS` and third party taps.
tap 'argon/mas'
tap 'buo/cask-upgrade', trusted: true
tap 'wickenico/wailbrew'

# Install dependencies for various utilities and applications.
brew 'aria2'
brew 'atuin'
brew 'avasilic/goto/goto-ssh', trusted: true
brew 'bat'
brew 'bottom'
brew 'displayplacer'
brew 'eva'
brew 'eza'
brew 'fastfetch'
brew 'fdupes'
brew 'ffmpeg'
brew 'fish'
brew 'fisher'
brew 'fzf'
brew 'gemini-cli'
brew 'getsentry/tools/sentry-cli', trusted: true
brew 'gh'
brew 'helix'
brew 'jless'
brew 'jq'
brew 'logcli'
brew 'mas'
brew 'media-control'
brew 'opencode'
brew 'scrcpy'
brew 'sd'
brew 'starship'
brew 'superfile'
brew 'tig'
brew 'tmux'
brew 'tw93/tap/mole', trusted: true
brew 'witr'
brew 'xh'
brew 'zoxide'

# Install applications.
cask '1password'
cask '1password-cli'
cask 'adobe-acrobat-reader'
cask 'android-platform-tools'
cask 'brave-browser'
cask 'bruno'
cask 'claude-code'
cask 'datagrip'
cask 'docker-desktop'
cask 'filen'
cask 'flameshot'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'google-chrome'
cask 'google-drive'
cask 'google-gemini'
cask 'localsend'
cask 'maccy'
cask 'macfuse'
cask 'mediosz/tap/swipeaerospace', trusted: true
cask 'nikitabobko/tap/aerospace', trusted: true
cask 'nordvpn'
cask 'obsidian'
cask 'rustdesk'
cask 'sanyam-g/switch/switch', trusted: true
cask 'signal'
cask 'spotify'
cask 'syncthing-app'
cask 'utm'
cask 'veracrypt'
cask 'viber'
cask 'visual-studio-code'
cask 'wailbrew'
cask 'wezterm'
cask 'whatsapp'
